src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
				<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключатьВОтчеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьКонтрагент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественныйВыбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/Catalogs/НаборыСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НаборыСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	ОткрываетсяИзНабораСвойств = Параметры.ОткрываетсяИзНабораСвойств;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВключатьВОтчеты = Истина;
		
		Если Параметры.ОткрываетсяИзНабораСвойств Тогда
			Если ЗначениеЗаполнено(Параметры.Копируемый) Тогда
				Объект.Наименование              = Параметры.Копируемый.Наименование;
				Объект.Родитель                  = Параметры.Копируемый.Родитель;
				Объект.ВключатьВОтчеты           = Параметры.Копируемый.ВключатьВОтчеты;
				Объект.ЭтоДополнительноеСведение = Параметры.Копируемый.ЭтоДополнительноеСведение;
			ИначеЕсли ЗначениеЗаполнено(Параметры.Родитель) Тогда
				Объект.Родитель = ?(Параметры.Родитель.ЭтоГруппа, Параметры.Родитель, Параметры.Родитель.Родитель);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоДополнительноеСведениеРеквизит = Объект.ЭтоДополнительноеСведение;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеРеквизиты.Ссылка КАК Набор,
		|	ДополнительныеРеквизиты.Ссылка.Наименование
		|ИЗ
		|	Справочник.НаборыСвойств.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|ГДЕ
		|	ДополнительныеРеквизиты.Свойство = &Свойство
		|	И (НЕ ДополнительныеРеквизиты.Ссылка.ЭтоГруппа)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Ссылка,
		|	ДополнительныеСведения.Ссылка.Наименование
		|ИЗ
		|	Справочник.НаборыСвойств.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И (НЕ ДополнительныеСведения.Ссылка.ЭтоГруппа)");
		
		Запрос.УстановитьПараметр("Свойство", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			спсНаборов.Добавить(Выборка.Набор, Выборка.Наименование);
		КонецЦикла;
	
	КонецЕсли;
	
	ОбновитьНадписьОНаборах();
	
	Элементы.ГруппаОтображение.Видимость = ?(Параметры.Свойство("ЭтоНаборСвойствКлиент"), Параметры.ЭтоНаборСвойствКлиент, Ложь);
	
	ДоступностьЭлемента = (Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Сотрудники")
		Или Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты")
		Или Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Номенклатура")
		Или Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы")
		Или Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));

	Элементы.МножественныйВыбор.Доступность = ДоступностьЭлемента;

	ВыбратьГруппуЗаголовок = "";
	Для Каждого СтрокаТЧ Из Объект.Группы Цикл
		ВыбратьГруппуЗаголовок = ВыбратьГруппуЗаголовок + ?(ЗначениеЗаполнено(ВыбратьГруппуЗаголовок), ", " 
			+ Строка(СтрокаТЧ.Группа), Строка(СтрокаТЧ.Группа));
		
	КонецЦикла;		

	Если ЗначениеЗаполнено(ВыбратьГруппуЗаголовок) Тогда
		Элементы.ВыбратьГруппу.Заголовок = ВыбратьГруппуЗаголовок;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, Параметры = Неопределено) Экспорт
	
	Если Не Параметры.Свойство("КогдаНаименованиеУжеИспользуется") Тогда
		Если ТипЗнч(Отказ) = Тип("КодВозвратаДиалога") И Отказ = КодВозвратаДиалога.ОК Тогда
			Записать = Истина;
		ИначеЕсли ТипЗнч(Отказ) = Тип("КодВозвратаДиалога") И Отказ = КодВозвратаДиалога.Отмена Тогда
			Записать = Ложь;
		КонецЕсли;
		
		// Проверим, есть ли с таким же наименованием свойство
		Если ЕстьСТакимЖеНаименованием(Объект.Наименование, Объект.Ссылка) Тогда
			Если Записать = Неопределено Тогда	
				ТекстВопроса = НСтр("ru = 'С указанным наименованием уже был введен ранее доп.реквизит/сведение.
				|Продолжить запись?'");
				ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписью", ЭтотОбъект, Параметры), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);					   
				Отказ = Истина;
			ИначеЕсли  Записать = Истина Тогда
				Параметры.Вставить("КогдаНаименованиеУжеИспользуется");
				Записать(Параметры);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект)
	
	Если ОткрываетсяИзНабораСвойств Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеРеквизиты.Ссылка КАК Набор,
	|	ЛОЖЬ КАК ВходитВНабор,
	|	ЛОЖЬ КАК ДополнительноеСведение
	|ИЗ
	|	Справочник.НаборыСвойств.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	((НЕ ДополнительныеРеквизиты.Ссылка В (&ВключенВНаборы))
	|			ИЛИ &ЭтоДополнительноеСведение)
	|	И (НЕ ДополнительныеРеквизиты.Ссылка.ЭтоГруппа)
	|	И ДополнительныеРеквизиты.Свойство = &Свойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Ссылка,
	|	ЛОЖЬ,
	|	ИСТИНА
	|ИЗ
	|	Справочник.НаборыСвойств.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	((НЕ ДополнительныеСведения.Ссылка В (&ВключенВНаборы))
	|			ИЛИ (НЕ &ЭтоДополнительноеСведение))
	|	И (НЕ ДополнительныеСведения.Ссылка.ЭтоГруппа)
	|	И ДополнительныеСведения.Свойство = &Свойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборыСвойств.Ссылка,
	|	ИСТИНА,
	|	&ЭтоДополнительноеСведение
	|ИЗ
	|	Справочник.НаборыСвойств КАК НаборыСвойств
	|ГДЕ
	|	НаборыСвойств.Ссылка В(&ВключенВНаборы)
	|	И (НЕ НаборыСвойств.ДополнительныеРеквизиты.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ДополнительныеРеквизиты.Ссылка КАК Набор
	|				ИЗ
	|					Справочник.НаборыСвойств.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|				ГДЕ
	|					ДополнительныеРеквизиты.Ссылка В (&ВключенВНаборы)
	|					И (НЕ ДополнительныеРеквизиты.Ссылка.ЭтоГруппа)
	|					И ДополнительныеРеквизиты.Свойство = &Свойство
	|					И (НЕ &ЭтоДополнительноеСведение)
	|		
	|				ОБЪЕДИНИТЬ ВСЕ
	|		
	|				ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ДополнительныеСведения.Ссылка КАК Набор
	|				ИЗ
	|					Справочник.НаборыСвойств.ДополнительныеСведения КАК ДополнительныеСведения
	|				ГДЕ
	|					ДополнительныеСведения.Ссылка В (&ВключенВНаборы)
	|					И (НЕ ДополнительныеСведения.Ссылка.ЭтоГруппа)
	|					И ДополнительныеСведения.Свойство = &Свойство
	|					И &ЭтоДополнительноеСведение))");
	
	Запрос.Параметры.Вставить("Свойство", ТекущийОбъект.Ссылка);
	Запрос.Параметры.Вставить("ЭтоДополнительноеСведение", ТекущийОбъект.ЭтоДополнительноеСведение);
	Запрос.Параметры.Вставить("ВключенВНаборы", спсНаборов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборСвойств = Выборка.Набор.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(Выборка.Набор);
		
		Если Выборка.ВходитВНабор Тогда
			
			Если Выборка.ДополнительноеСведение Тогда
				
				НаборСвойств.ДополнительныеСведения.Добавить().Свойство = ТекущийОбъект.Ссылка;
				
			Иначе
				
				НаборСвойств.ДополнительныеРеквизиты.Добавить().Свойство = ТекущийОбъект.Ссылка;
				
			КонецЕсли;
			
		Иначе
			
			Если Выборка.ДополнительноеСведение Тогда
				
				НаборСвойств.ДополнительныеСведения.Удалить(НаборСвойств.ДополнительныеСведения.Найти(ТекущийОбъект.Ссылка, "Свойство"));
				
			Иначе
				
				НаборСвойств.ДополнительныеРеквизиты.Удалить(НаборСвойств.ДополнительныеРеквизиты.Найти(ТекущийОбъект.Ссылка, "Свойство"));
				
			КонецЕсли;
			
		КонецЕсли;
		
		НаборСвойств.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("Ссылка", Объект.Ссылка);
	СтруктураОповещения.Вставить("ЭтоДополнительноеСведение", Объект.ЭтоДополнительноеСведение);
	
	Оповестить("ЗаписаноДополнительноеСвойство", СтруктураОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭтоДополнительноеСведениеРеквизитПриИзменении(Элемент)
	Объект.ЭтоДополнительноеСведение = ЭтоДополнительноеСведениеРеквизит;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура назначается динамически действию кнопки командной панели КоманднаяПанельформы.КнопкиДействий.Кнопка
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаПоискаСсылокНаПВХ", Новый Структура("Ссылка", Объект.Ссылка),,,,, Новый ОписаниеОповещения("Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСписокНаборовВыполнить()
	
	ОткрытьСписокНаборов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = НЕ Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

// Процедура - Выбрать группу
//
&НаКлиенте
Процедура ВыбратьГруппу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьГруппуЗавершение", ЭтаФорма);
	ПараметрыФормы     = Новый Структура("спсНаборов, Группы", спсНаборов, Объект.Группы);
	
	ОткрытьФорму("Справочник.НаборыСвойств.Форма.ФормаВыбораГрупп", ПараметрыФормы, ЭтаФорма,,,, 
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Процедура - Выбрать группу завершение
//
&НаКлиенте
Процедура ВыбратьГруппуЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда

		Объект.Группы.Очистить();
		
		ВыбратьГруппуЗаголовок = "";
		Для Каждого ЭлементСписка Из Результат Цикл
			НоваяСтрока        = Объект.Группы.Добавить();
			НоваяСтрока.Группа = ЭлементСписка.Значение;
			ВыбратьГруппуЗаголовок = ВыбратьГруппуЗаголовок + ?(ЗначениеЗаполнено(ВыбратьГруппуЗаголовок), ", " 
				+ Строка(ЭлементСписка.Значение), Строка(ЭлементСписка.Значение));
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ВыбратьГруппуЗаголовок) Тогда
			Элементы.ВыбратьГруппу.Заголовок = ВыбратьГруппуЗаголовок;
		Иначе
			Элементы.ВыбратьГруппу.Заголовок = "Выбор групп";
		КонецЕсли;

		ЗаписатьНаСервере();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, Результат);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСТакимЖеНаименованием(Наименование, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Наименование = &Наименование
	|	И ДополнительныеРеквизитыИСведения.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",       Ссылка);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ОбновитьНадписьОНаборах()
	
	Колво = спсНаборов.Количество();
	Если Колво = 0 Тогда
		ИнформационнаяНадпись = НСтр("ru = 'Не входит ни в один набор'");
	ИначеЕсли Колво = 1 Тогда
		ИнформационнаяНадпись =
		  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		    НСтр("ru = 'Входит в набор: %1'"), спсНаборов[0].Представление);
	Иначе
		СтрНаборы = СокрЛП(ЧислоПрописью(Колво, "НД=Ложь", "набор,набора,наборов,м,,,,,0"));
		Пока Истина Цикл
			Поз = Найти(СтрНаборы, " ");
			Если Поз = 0 Тогда
				Прервать;
			КонецЕсли;
			СтрНаборы =СокрЛП(Сред(СтрНаборы, Поз+1));
		КонецЦикла;
		
		ИнформационнаяНадпись = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		                          НСтр("ru = 'Входит в %1 %2'"), Колво, СтрНаборы );
	КонецЕсли;
	
	Элементы.РедактироватьСписокНаборов.Заголовок = ИнформационнаяНадпись;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокНаборов()
	
	//Если ОткрываетсяИзНабораСвойств Тогда
	//	ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Свойство открыто из формы набора.
	//	                          |Редактирование списка наборов по свойству не производится!'"));
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("ВыбранныеНаборы", спсНаборов);
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаРедактированияСпискаНаборов", 
		ПараметрыОткрытия,,,,, Новый ОписаниеОповещения("ОткрытьСписокНаборовЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокНаборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	спсНаборов = Результат;
	ОбновитьНадписьОНаборах();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	ДоступностьЭлемента = (Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Сотрудники")
		Или Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты")
		Или Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Номенклатура")
		Или Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы")
		Или Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));

	Элементы.МножественныйВыбор.Доступность = ДоступностьЭлемента;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ЭтотОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти
